tap "homebrew/bundle"
tap "homebrew/cask-fonts"
# shells
brew "bash"
brew "zsh"
brew "fish"
brew "nushell"
# utils
brew "coreutils"
brew "findutils"
brew "diffutils"
brew "gnu-sed"
brew "curl"
brew "bat"
brew "fd"
brew "sd"
brew "lsd"
brew "ripgrep"
brew "fzf"
brew "starship"
brew "zoxide"
brew "pssh"
brew "parallel"
brew "rename"
brew "watch"
brew "tealdeer"
brew "direnv"
brew "htop"
brew "terminal-notifier"
# data
brew "xsv"
brew "jq"
brew "htmlq"
brew "miller"
# markdown
brew "mdbook"
brew "mdcat"
# terminal
brew "tmux"
# network
brew "rsync"
brew "socat"
brew "iproute2mac"
brew "autossh"
brew "wget"
brew "caddy"
# editors
brew "vim"
brew "helix"
brew "dprint"
brew "marksman"
# git
brew "git"
brew "git-lfs"
brew "git-delta"
brew "lazygit"
brew "gh"
# languages
brew "llvm"
brew "go"
brew "python"
brew "node"
brew "openjdk"
brew "openjdk@11"
brew "rustup"
brew "ant"
brew "maven"
brew "grpcurl"
brew "protobuf"
brew "bufbuild/buf/buf"
brew "spotbugs"
# tools
brew "translate-shell"
brew "zk"
brew "just"
brew "rargs"
brew "fortune"
# publish
brew "pandoc"
brew "pandoc-crossref"
brew "yt-dlp"
brew "zola"
# fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# apps
cask "alacritty"
cask "anki"
cask "authy"
cask "brave-browser"
cask "google-chrome"
cask "dropbox"
# desktop
cask "xquartz"
cask "alfred"
cask "eqmac"
cask "hiddenbar"
cask "keycastr"
cask "microsoft-remote-desktop"
cask "rectangle"
# development
cask "github"
cask "intellij-idea-ce"
cask "obsidian"
cask "mat"
cask "sublime-text"
# reading
cask "netnewswire"
cask "send-to-kindle"
# vms
cask "multipass"
cask "vagrant"
cask "virtualbox"
# communication
cask "slack"
cask "telegram"
cask "wechat"
cask "zoom"
# mas
mas "pocket", id: 568494494
mas "save-to-pocket", id: 1477385213
mas "medis", id: 1579200037
mas "vimari", id: 1480933944
mas "tomito", id: 1526042938
