tap "homebrew/bundle"
tap "hashicorp/tap"
# shells
brew "bash"
brew "fish"
# utils
brew "coreutils"
brew "findutils"
brew "diffutils"
brew "gnu-sed"
brew "curl"
brew "bat"
brew "fd"
brew "sd"
brew "lsd"
brew "ripgrep"
brew "fzf"
brew "starship"
brew "zoxide"
brew "pssh"
brew "parallel"
brew "rename"
brew "watch"
brew "tealdeer"
brew "direnv"
brew "htop"
brew "terminal-notifier"
# data
brew "jq"
brew "htmlq"
brew "mdq"
# markdown
brew "mdbook"
brew "glow"
# terminal
brew "tmux"
# network
brew "rsync"
brew "socat"
brew "autossh"
brew "wget"
# editors
brew "vim"
# git
brew "git"
brew "git-lfs"
brew "git-delta"
brew "lazygit"
brew "gh"
# languages
brew "llvm"
# go
brew "go"
# nodejs
brew "node"
# rust
brew "rustup"
# java
brew "openjdk"
brew "ant"
brew "maven"
brew "spotbugs"
# python
brew "python"
brew "uv"
# protobuf
brew "grpcurl"
brew "protobuf"
brew "buf"
# tools
brew "zk"
brew "just"
brew "rargs"
brew "fortune"
# publish
brew "pandoc"
brew "pandoc-crossref"
brew "yt-dlp"
brew "zola"
brew "asciinema"
brew "agg"
# ai
brew "gemini-cli"
brew "codex"
# fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# apps
cask "alacritty"
cask "anki"
cask "brave-browser"
cask "google-chrome"
cask "dropbox"
# desktop
cask "alfred"
cask "eqmac"
cask "iina"
cask "keycastr"
cask "hyperkey"
cask "microsoft-remote-desktop"
# development
cask "pronotes"
cask "github"
cask "intellij-idea-ce"
cask "obsidian"
cask "memoryanalyzer"
cask "zed"
cask "sublime-text"
# reading
cask "send-to-kindle"
cask "kindle-previewer"
# vms
cask "orbstack"
cask "vagrant"
cask "virtualbox"
cask "xquartz"
# communication
cask "slack"
cask "telegram"
cask "wechat"
cask "zoom"
# mas
mas "medis", id: 1579200037
mas "vimari", id: 1480933944
mas "tomito", id: 1526042938
