tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
# shells
brew "bash"
brew "zsh"
brew "fish"
# utils
brew "coreutils"
brew "findutils"
brew "diffutils"
brew "gnu-sed"
brew "fd"
brew "sd"
brew "lsd"
brew "ripgrep"
brew "fzf"
brew "zoxide"
brew "parallel"
brew "rename"
brew "watch"
brew "tldr"
brew "direnv"
brew "htop"
# data
brew "xsv"
brew "jq"
brew "miller"
# terminal
brew "tmux"
# network
brew "rsync"
brew "socat"
brew "iproute2mac"
brew "autossh"
brew "wget"
# editors
brew "vim"
brew "neovim"
brew "helix"
# git
brew "git"
brew "git-lfs"
brew "git-delta"
brew "lazygit"
brew "gh"
# languages
brew "go"
brew "python"
brew "node"
brew "openjdk@11"
brew "rustup"
brew "rust-analyzer"
brew "ant"
brew "protobuf"
brew "spotbugs"
# containers
brew "docker"
# publish
brew "pandoc"
brew "pandoc-crossref"
brew "asciinema"
brew "yt-dlp"
brew "zola"
# fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# apps
cask "alacritty"
cask "anki"
cask "authy"
cask "brave-browser"
cask "dropbox"
# desktop
cask "alfred"
cask "eqmac"
cask "hiddenbar"
cask "tomatobar"
cask "keycastr"
cask "microsoft-remote-desktop"
cask "rectangle"
# development
cask "github"
cask "intellij-idea-ce"
cask "logseq"
cask "mat"
cask "sublime-text"
# reading
cask "netnewswire"
cask "send-to-kindle"
# vms
cask "multipass"
cask "vagrant"
cask "virtualbox"
# communication
cask "slack"
cask "telegram"
cask "wechat"
cask "zoom"
# mas
mas "pocket", id: 568494494
mas "save-to-pocket", id: 1477385213
mas "medis", id: 1579200037
mas "vimari", id: 1480933944
