anki
ant
dart
dictd
docker
docker-compose
dos2unix
firefox
fzf
go
goldendict
hub
ibus-libpinyin
iio-sensor-proxy
intellij-idea-community-edition
jdk-openjdk
jq
manjaro-pulse
mosh
mpc
mpd
mps-youtube
mpv
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
openjdk-doc
openjdk-src
pa-applet
pavucontrol
powerline
powerline-fonts
pulseaudio-alsa
pulseaudio-bluetooth
qt5ct
qt5-styleplugins
ripgrep
rofi
sdcv
telegram-desktop
tmux
unrar
vagrant
vim
virtualbox
xfreerdp
xss-lock
youtube-dl
zathura
zathura-djvu
zathura-pdf-mupdf
zathura-ps
zeal
